01  WS-AREA-1 PIC X(10). 01  WS-AREA-2 PIC 9(5) VALUE 0. 01 WS-AREA-3 PIC 9(5).   MOVE '1234567890' TO WS-AREA-1. IF WS-AREA-1 NUMERIC THEN    MOVE WS-AREA-1 TO WS-AREA-3     ADD 1 TO WS-AREA-2 ELSE    DISPLAY "ERROR: Non-numeric value encountered" END-IF. DISPLAY WS-AREA-1, WS-AREA-2, WS-AREA-3.